Revit 2027 API
FabricationPart.GetPartAncillaryUsage Method
 Gets a list of all ancillary usage information for the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationAncillaryUsage> GetPartAncillaryUsage()
Public Function GetPartAncillaryUsage As IList(Of FabricationAncillaryUsage)
public:
IList<FabricationAncillaryUsage^>^ GetPartAncillaryUsage()
member GetPartAncillaryUsage : unit -> IList<FabricationAncillaryUsage>
Return Value
IList<FabricationAncillaryUsage>
 Returns array of usage information, one per unique type of ancillary used.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace